{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "batch_input_shape": [null, 45], "output_dim": 1, "embeddings_constraint": null, "dtype": "float32", "input_length": 45, "mask_zero": false, "embeddings_regularizer": null, "name": "embedding_1", "trainable": true, "input_dim": 46, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "dropout": 0.2, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "unroll": false, "unit_forget_bias": true, "recurrent_regularizer": null, "trainable": true, "recurrent_dropout": 0.2, "go_backwards": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 1, "kernel_constraint": null, "use_bias": true, "activation": "tanh", "name": "lstm_1", "units": 150, "stateful": false, "return_state": false}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "softmax", "name": "dense_1", "trainable": true, "units": 2, "bias_constraint": null}}]}