{"keras_version": "2.3.0", "backend": "tensorflow", "config": {"layers": [{"config": {"output_dim": 1, "dtype": "float32", "embeddings_regularizer": null, "mask_zero": false, "batch_input_shape": [null, 45], "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "trainable": true, "input_length": 45, "activity_regularizer": null, "input_dim": 46, "name": "embedding_1"}, "class_name": "Embedding"}, {"config": {"unit_forget_bias": true, "recurrent_activation": "sigmoid", "implementation": 2, "unroll": false, "trainable": true, "go_backwards": false, "dropout": 0.2, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "activation": "tanh", "return_sequences": false, "units": 150, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "name": "lstm_1", "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "stateful": false, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_dropout": 0.2, "bias_constraint": null, "kernel_regularizer": null, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"dtype": "float32", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax", "bias_constraint": null, "units": 3, "name": "dense_1", "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}