{"config": {"name": "sequential_1", "layers": [{"config": {"input_dim": 46, "dtype": "float32", "batch_input_shape": [null, 45], "embeddings_constraint": null, "mask_zero": false, "name": "embedding_1", "trainable": true, "output_dim": 1, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "input_length": 45}, "class_name": "Embedding"}, {"config": {"recurrent_regularizer": null, "recurrent_activation": "sigmoid", "name": "lstm_1", "activity_regularizer": null, "stateful": false, "return_sequences": false, "implementation": 2, "unroll": false, "bias_constraint": null, "unit_forget_bias": true, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "recurrent_constraint": null, "return_state": false, "go_backwards": false, "activation": "tanh", "bias_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 150, "dropout": 0.2, "recurrent_dropout": 0.2, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dtype": "float32", "activation": "softmax", "name": "dense_1", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 3, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.3.0", "backend": "tensorflow"}